app/Models/ProductionModel.php

    function showProductTotalQTY()
    {
        $table = $this->db->table($this->table);
        $query = $table->select('name, sum(totalQty) as totalQTY')
            ->join('dimproduct', 'factproduction.productID=dimproduct.productID', 'inner')
            ->groupBy('factproduction.productID')
            ->orderBy('totalQTY', 'DESC')
            ->limit(5);

        $data = $query->get()->getResultObject();
---
SELECT sum(totalQty) as totalQTY
FROM `factproduction`
SELECT `name`, sum(totalQty) as totalQTY
FROM `factproduction`
INNER JOIN `dimproduct` ON `factproduction`.`productID`=`dimproduct`.`productID`
GROUP BY `factproduction`.`productID`
ORDER BY `totalQTY` DESC
 LIMIT 5

    function showDay()
    {
        $table = $this->db->table($this->table);
        $query = $table->select('distinct(day) as day')
            ->join('dimtime', 'factproduction.timeID=dimtime.timeID', 'inner')
            ->orderBy('day', 'ASC');

        return $query->get()->getResultObject();
---
SELECT distinct(day) as day
FROM `factproduction`
INNER JOIN `dimtime` ON `factproduction`.`timeID`=`dimtime`.`timeID`
ORDER BY `day` ASC

    function showDayProduction($day)
    {
        $table = $this->db->table($this->table);
        $query = $table->select('day, name, totalQTY')
            ->join('dimproduct', 'factproduction.productID=dimproduct.productID', 'inner')
            ->join('dimtime', 'factproduction.timeID=dimtime.timeID', 'inner')
            ->where('day', $day)
            ->groupBy('name');

        return $query->get()->getResultObject();
---
SELECT `day`, `name`, `totalQTY`
FROM `factproduction`
INNER JOIN `dimproduct` ON `factproduction`.`productID`=`dimproduct`.`productID`
INNER JOIN `dimtime` ON `factproduction`.`timeID`=`dimtime`.`timeID`
WHERE `day` = 'Friday'
GROUP BY `name`

    function showDayQTY()
    {
        $table = $this->db->table($this->table);
        $query = $table->select('day, sum(totalQTY) as totalQTY')
            ->join('dimtime', 'factproduction.timeID=dimtime.timeID', 'inner')
            ->groupBy('day')
            ->orderBy('totalQTY', 'DESC');

        return $query->get()->getResultObject();
---
SELECT `day`, sum(totalQTY) as totalQTY
FROM `factproduction`
INNER JOIN `dimtime` ON `factproduction`.`timeID`=`dimtime`.`timeID`
GROUP BY `day`
ORDER BY `totalQTY` DESC

    function showProduct()
    {
        $table = $this->db->table($this->table);
        $query = $table->select('distinct(name) as name')
            ->join('dimproduct', 'factproduction.productID=dimproduct.productID', 'inner')
            ->orderBy('name', 'ASC')
            ->groupBy('factproduction.productID');

        return $query->get()->getResultObject();
---
SELECT distinct(name) as name
FROM `factproduction`
INNER JOIN `dimproduct` ON `factproduction`.`productID`=`dimproduct`.`productID`
GROUP BY `factproduction`.`productID`
ORDER BY `name` ASC

    function showProductDay($name)
    {
        $table = $this->db->table($this->table);
        $query = $table->select('day, sum(totalQty) as totalQty')
            ->join('dimproduct', 'factproduction.productID=dimproduct.productID', 'inner')
            ->join('dimtime', 'factproduction.timeID=dimtime.timeID', 'inner')
            ->where('name', $name)
            ->orderBy('day', 'ASC')
            ->groupBy('factproduction.productID');

        return $query->get()->getResultObject();
---
SELECT `day`, sum(totalQty) as totalQty
FROM `factproduction`
INNER JOIN `dimproduct` ON `factproduction`.`productID`=`dimproduct`.`productID`
INNER JOIN `dimtime` ON `factproduction`.`timeID`=`dimtime`.`timeID`
WHERE `name` = 'Adjustable Race'
GROUP BY `factproduction`.`productID`
ORDER BY `day` ASC