app/Models/SalesModel.php

SELECT distinct(country)
FROM `factsales`
INNER JOIN `dimaddress` ON `factsales`.`addressID`=`dimaddress`.`addressID`
ORDER BY `country` ASC
---
    public function showCountry()
    {
        $table = $this->db->table($this->table);
        $query = $table->select('distinct(country)')
            ->join('dimaddress', 'factsales.addressID=dimaddress.addressID', 'inner')
            ->orderBy('country', 'asc');

        return $query->get()->getResultObject();

SELECT `country`, `city`, count(*) as sales
FROM `factsales`
INNER JOIN `dimaddress` ON `factsales`.`addressID`=`dimaddress`.`addressID`
WHERE `country` = 'Alabama'
GROUP BY `city`
ORDER BY `sales` DESC
---
    public function showTransactionCity($country)
    {

        $table = $this->db->table($this->table);
        $query = $table->select('country, city, count(*) as sales')
            ->join('dimaddress', 'factsales.addressID=dimaddress.addressID', 'inner')
            ->where('country', $country)
            ->groupBy('city')
            ->orderBy('sales', 'desc');

        return $query->get()->getResultObject();

SELECT `country`, count(*) as sales
FROM `factsales`
INNER JOIN `dimaddress` ON `factsales`.`addressID`=`dimaddress`.`addressID`
WHERE `country` = 'Alabama'
GROUP BY `country`
ORDER BY `sales` DESC
---
    public function totalTransactionCity($country)
    {
        $table = $this->db->table($this->table);
        $query = $table->select('country, count(*) as sales')
            ->join('dimaddress', 'factsales.addressID=dimaddress.addressID', 'inner')
            ->where('country', $country)
            ->groupBy('country')
            ->orderBy('sales', 'desc');

        return $query->get()->getFirstRow();